g3gg0/esp8266can/ESP8266Can.cpp
/*
ESP8266Can.cpp - CAN library for ESP8266 using cycle count
Copyright (c) 2016 by g3gg0.de. All right reserved.

This library is free software; you can redistribute it and/or
modify it under the terms of the GNU Lesser General Public
License as published by the Free Software Foundation; either
version 2.1 of the License, or (at your option) any later version.

This library is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
Lesser General Public License for more details.

You should have received a copy of the GNU Lesser General Public
License along with this library; if not, write to the Free Software
Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#if defined(ESP8266)

#include <Arduino.h>
#include <ESP8266Can.h>
#include <eagle_soc.h>

#define LEADING_BITS            (5U)
#define BASEFREQ                (160000000L)

#define COUNT(x) (sizeof(x) / sizeof((x)[0]))

#define CLEAR_SET_REG_POS(reg,pos,mask,set) \
    do { \
        CLEAR_PERI_REG_MASK(reg,(mask)<<(pos)); \
        SET_PERI_REG_MASK(reg, (((uint32_t)(set))&(mask))<<(pos)); \
    } while(0)
        
    
extern "C"
{    
    #include "i2s_reg.h"
    #include "i2s.h"
    #include "eagle_soc.h"
    #include "esp8266_peri.h"
    #include "slc_register.h"
        
    /* intentionally keeping them as global variable because having them in class makes the code slower. 
       Defining as class members has no benefit as we can only be instanciated once anyway. */
    static uint8_t InterruptReceiveBuffers[INT_RX_BUFFERS][INT_RX_BUFFER_SIZE];
    static uint8_t ReceiveBuffersReadNum = 0;
    static uint8_t ReceiveBuffersWriteNum = 0;
    static uint8_t ReceiveBitNum = 0;
    static uint32_t InterruptRxCount = 0;
    static uint32_t InterruptTxCount = 0;
    static uint8_t RxOversampling; 

    extern void rom_i2c_writeReg_Mask(uint32_t block, uint32_t host_id, uint32_t reg_add, uint32_t Msb, uint32_t Lsb, uint32_t indata);

    static inline uint32_t _getCycleCountRaw()
    {
        uint32_t ccount;
        
        __asm__ __volatile__("rsr %0,ccount":"=a" (ccount));
        
        return ccount;
    }
    
    #define _getCycleCount _getCycleCountRaw
    //#define _getCycleCount _getCycleCountMod
    
    static inline uint64_t _getCycleCountMod()
    {
        static uint32_t lastValue = 0;
        static uint64_t overflows = 0;
        uint32_t ccount;
        
        __asm__ __volatile__("rsr %0,ccount":"=a" (ccount));
        
        if(ccount < lastValue)
        {
            overflows++;
        }
        lastValue = ccount;
        
        return (overflows << 32) | lastValue;
    }

    can_error_t ICACHE_RAM_ATTR sendRawData(uint8_t* buffer, uint32_t cyclesBit, uint32_t cyclesSample, uint16_t skip, uint16_t bits, uint8_t pinRegisterTx, uint8_t pinRegisterRx)
    {
        /*  */
        while(_getCycleCount() > (0xFFFFFFFF - ((30 + 19 + 64 + 10 + 50) * cyclesBit)));
        
        uint8_t ackSlot = bits - 8;
        uint64_t cyclesStart = _getCycleCount();
        
        /* disable interrupts */
        uint32_t _state = xt_rsil(15);
        
        /* make sure the line is recessive for n consecutive bits */
        cyclesStart += (30 * cyclesBit);
        
        while (_getCycleCount() < cyclesStart)
        {
        #if 0
            if(!(GPIO_REG_READ(GPIO_IN_ADDRESS) & pinRegisterRx))
            {
                /* return busy */
                xt_wsr_ps(_state);
                return ERR_BUSY_LINE;
            }
        #endif
        }

        /* first bit always dominant */
        GPIO_REG_WRITE(GPIO_OUT_W1TC_ADDRESS, pinRegisterTx);
        
        /* now write the bits */
        can_error_t ret = ERR_NO_ACK;
        uint32_t bitNum = 0;
        uint8_t dominantBits = 0;
        uint8_t recessiveBits = 0;
        
        while (1)
        {
            uint8_t data = *buffer++;

            for (uint8_t mask = 0x80; mask != 0; mask >>= 1)
            {
                /* silently skip the first bits in input buffer */
                if(skip)
                {
                    skip--;
                    continue;
                }
                
                bool txRecessive = ((data & mask) != 0);
                
                /* no stuffing in ACK slot */
                if(bitNum >= ackSlot - 1)
                {
                    recessiveBits = 0;
                    dominantBits = 0;
                }
                /* after 5 consecutive bits the same polarity, insert a stuff bit */
                else if(recessiveBits == 5)
                {
                    /* first check recessive bits */
                    dominantBits = 1;
                    recessiveBits = 0;
                    
                    /* wait till last bit ends */
                    while (_getCycleCount() < cyclesStart)
                    {
                    }
                
                    GPIO_REG_WRITE(GPIO_OUT_W1TC_ADDRESS, pinRegisterTx);
                    cyclesStart += cyclesBit;
                }
                else if(dominantBits == 5)
                {
                    /* then dominant bits */
                    dominantBits = 0;
                    recessiveBits = 1;
                    
                    /* wait till last bit ends */
                    while (_getCycleCount() < cyclesStart)
                    {
                    }
                    
                    GPIO_REG_WRITE(GPIO_OUT_W1TS_ADDRESS, pinRegisterTx);
                    cyclesStart += cyclesBit;
                }
                
                /* set the TX line */
                if(txRecessive)
                {
                    dominantBits = 0;
                    recessiveBits++;
                    
                    /* wait till last bit (or stuff bit) ends */
                    while (_getCycleCount() < cyclesStart)
                    {
                    }
                    GPIO_REG_WRITE(GPIO_OUT_W1TS_ADDRESS, pinRegisterTx);
                }
                else
                {
                    recessiveBits = 0;
                    dominantBits++;
                    
                    /* wait till last bit (or stuff bit) ends */
                    while (_getCycleCount() < cyclesStart)
                    {
                    }
                    GPIO_REG_WRITE(GPIO_OUT_W1TC_ADDRESS, pinRegisterTx);
                }
                
                /* wait until we shall sample the RX line */
                while (_getCycleCount() < (cyclesStart + cyclesSample))
                {
                }

                /* do so, read the RX line status */
                bool rxRecessive = ((GPIO_REG_READ(GPIO_IN_ADDRESS) & pinRegisterRx) != 0);
                
                /* and check if the RX line is the same as the TX line */
                if(/* !!!!!!!!!!!!!!!!!!TEST!!!!!!!!!!!!!!!!!! */ 0 && rxRecessive != txRecessive)
                {
                    if(rxRecessive)
                    {
                        /* abort, transceiver seems not to send. sent dominant, but received recessive */
                        GPIO_REG_WRITE(GPIO_OUT_W1TS_ADDRESS, pinRegisterTx);
                        xt_wsr_ps(_state);
                        return ERR_TRCV_ERR;
                    }
                    else
                    {
                        if(bitNum == ackSlot)
                        {
                            ret = ERR_OK;
                        }
                        else
                        {
                            /* abort, there was a collision */
                            GPIO_REG_WRITE(GPIO_OUT_W1TS_ADDRESS, pinRegisterTx);
                            xt_wsr_ps(_state);
                            return (can_error_t)bitNum;
                        }
                    }                    
                }
                
                /* increment bit position */
                bitNum++;
                if(bitNum >= bits)
                {
                    /* if all bits were transferred, return */
                    GPIO_REG_WRITE(GPIO_OUT_W1TS_ADDRESS, pinRegisterTx);
                    xt_wsr_ps(_state);
                    return ERR_OK;
                }
                
                /* update start timestamp so the next cycle will wait till the bit time is done */
                cyclesStart += cyclesBit;
            }
        }
    }
    
    static void ICACHE_RAM_ATTR parseBuffer(ESP8266Can *can, uint16_t *data, uint32_t data_length)
    {
        static uint8_t consecutiveBits = 0;
        static uint16_t prevBit = 0;
        static uint8_t stuffEnd = 0xFF;
        static bool undoStuff = false;
        
        /* where to store the CAN frame data */
        uint8_t *buf = InterruptReceiveBuffers[ReceiveBuffersWriteNum];
        
