g3gg0/esp8266can/ESP8266Can.cpp
        /* parse the received buffer, count all bits in it */
        for(uint32_t wordPos = 0; wordPos < data_length; wordPos++)
        {
            uint32_t thisWord = data[wordPos ^ 1];
            
            /* every element is 16 bits */
            for(uint32_t bitPos = 0; bitPos < 16; bitPos++)
            {
                uint16_t thisBit = thisWord & 0x8000;
                
                /* when enough bits received, we can extract the DLC. just do once until stuffEnd is known */
                if((ReceiveBitNum >= 19) && (stuffEnd == 0xFF))
                {
                    uint8_t length = 0;
                    can->DecodeCanFrame(buf, NULL, &length, NULL, NULL, NULL, false);
                    /* we only need the length to know when there is no stuffing anymore */
                    stuffEnd = 19 + (length * 8) + 16;
                }
            
                /* if the bit level changed, check how many bits were consecutive high or low */
                if(thisBit != prevBit)
                {
                    /* append (oversampled) bit count or terminate buffer */
                    if(ReceiveBitNum == 0 && prevBit)
                    {
                        /* received n bits of *recessive* data before our frame starts.
                           this is the "inactive" bus. just throw these bits away. */
                    }
                    else
                    {
                        /* now calculate how many bits were received */
                        uint8_t bits = (consecutiveBits + RxOversampling / 2) / RxOversampling;
                        
                        /* process that number of bits */
                        for(uint8_t bit = 0; bit < bits; bit++)
                        {
                            /* if this will be a stuff bit, ignore it */
                            if(!undoStuff)
                            {
                                /* now write the number of bits of the "last" bit level */
                                if(prevBit)
                                {
                                    /* in the output buffer, there are some dummy bits for padding data properly */
                                    uint8_t bufBit = LEADING_BITS + ReceiveBitNum;
                                    if(bufBit / 8 < INT_RX_BUFFER_SIZE)
                                    {
                                        buf[(bufBit / 8)] |= 1 << (7 - (bufBit % 8));
                                    }
                                }
                                ReceiveBitNum++;
                            }
                            undoStuff = false;
                            
                            /* only handle stuff bits until reaching ACK */
                            if(ReceiveBitNum < stuffEnd)
                            {
                                /* 5th bit in row of the same level, insert a stuff bit */
                                if(bit == 4)
                                {
                                    undoStuff = true;
                                }
                                else if(bit >= 5)
                                {
                                    /* 5 bits in a row? must not happen */
                                    can->RxErrStuffBits++;
                                }
                            }
                        }
                    }
                    
                    /* there was a level change, so its the first bit of this level now */
                    consecutiveBits = 1;
                    prevBit = thisBit;
                }
                else if(consecutiveBits < 8 * RxOversampling)
                {
                    /* another bit of the same level until 8 bits of the same level were seen */
                    consecutiveBits++;
                }
                else if(ReceiveBitNum > 0)
                {
                    /* message ends, too many bits with same level */
                    //buf[0] = length;
                    
                    ReceiveBuffersWriteNum = ((ReceiveBuffersWriteNum + 1) % INT_RX_BUFFERS);
                    ReceiveBitNum = 0;
                    buf = InterruptReceiveBuffers[ReceiveBuffersWriteNum];
                    memset(buf, 0x00, INT_RX_BUFFER_SIZE);
                    
                    /* reset per-frame information */
                    stuffEnd = 0xFF;
                    
                    /* if we now - after incrementing - hit again the read buffer, we have an overrun */
                    if(ReceiveBuffersWriteNum == ReceiveBuffersReadNum)
                    {
                        can->RxQueueOverflows++;
                    }
                }
                
                /* evaluate the next bit */
                thisWord <<= 1;
            }
        }
    }
    
    static void ICACHE_RAM_ATTR i2sInterrupt(ESP8266Can *can) 
    {
        uint32_t slc_intr_status = READ_PERI_REG(SLC_INT_STATUS);
        WRITE_PERI_REG(SLC_INT_CLR, 0xFFFFFFFF);
        
        /* wait, that should not happen? */
        if(!slc_intr_status)
        {
            Serial.printf("zero status\n"); 
            return;            
        }

        /* the Rx interrupt happened - this is TRANSMITTED data! */
        if((slc_intr_status & SLC_RX_EOF_INT_ST))
        {
            /* reset flag */
            slc_intr_status &= ~SLC_RX_EOF_INT_ST;
            InterruptRxCount++;     
            
            /* prepare item for requeue */
            struct slc_queue_item *completed = (struct slc_queue_item*)READ_PERI_REG(SLC_RX_EOF_DES_ADDR);
            completed->owner = 1;
            
        }
        
        /* the Tx interrupt handled, which is the data we RECEIVE. weird, ya. */
        if((slc_intr_status & SLC_TX_EOF_INT_ST))
        {
            /* reset flag */
            slc_intr_status &= ~SLC_TX_EOF_INT_ST;
            InterruptTxCount++;
            
