g3gg0/esp8266can/ESP8266Can.cpp
            /* fetch filled buffer */
            struct slc_queue_item *completed = (struct slc_queue_item*)READ_PERI_REG(SLC_TX_EOF_DES_ADDR);
            
            /* go through all bits and count them, passing information to main loop context */
            parseBuffer(can, (uint16_t *)completed->buf_ptr, completed->datalen / 2);
            
            /* prepare item for requeue */
            completed->owner = 1;
        }
        
        if(slc_intr_status)
        {
            Serial.printf("unknown status: 0x%08X\n", slc_intr_status);        
        }
    }
}

ESP8266Can::ESP8266Can(uint32_t rate, uint8_t gpio_tx) : 
    _rate(rate), 
    _gpio_tx(gpio_tx), 
    _gpio_rx(D6),
    _maxTries(1024)
{
    digitalWrite(_gpio_tx, HIGH);
    pinMode(_gpio_rx, INPUT);
    pinMode(_gpio_tx, OUTPUT);
}

ESP8266Can::~ESP8266Can()
{
}

void ESP8266Can::StartRx()
{
    Serial.printf("ESP8266Can::StartRx\n");
    RxOversampling = (BASEFREQ / bestClkmDiv / bestBckDiv) / _rate;
    Serial.printf("   Rate:         %d\n", _rate);
    Serial.printf("   MDIV:         %d\n", bestClkmDiv);
    Serial.printf("   BCK:          %d\n", bestBckDiv);
    Serial.printf("   Samplingrate: %d\n", (BASEFREQ / bestClkmDiv / bestBckDiv));
    Serial.printf("   Oversampling: %d\n", RxOversampling);
    
    memset(InterruptReceiveBuffers, 0x00, sizeof(InterruptReceiveBuffers));
    InitI2S();
    StartI2S();
    Serial.printf("Started\n");
}

void ESP8266Can::StartI2S()
{
	/* start transmission for RX and TX */
	SET_PERI_REG_MASK(SLC_RX_LINK, SLC_RXLINK_START);
	SET_PERI_REG_MASK(SLC_TX_LINK, SLC_TXLINK_START);
    
	SET_PERI_REG_MASK(I2SCONF, I2S_I2S_RX_START);
	SET_PERI_REG_MASK(I2SCONF, I2S_I2S_TX_START);
}

void ESP8266Can::StopI2S()
{
	/* stop transmission for RX and TX */
	CLEAR_PERI_REG_MASK(I2SCONF, I2S_I2S_RX_START);
	CLEAR_PERI_REG_MASK(I2SCONF, I2S_I2S_TX_START);
    
	CLEAR_PERI_REG_MASK(SLC_RX_LINK, SLC_RXLINK_START);
	CLEAR_PERI_REG_MASK(SLC_TX_LINK, SLC_TXLINK_START);
}

void ESP8266Can::PrepareQueue(const char *name, struct slc_queue_item *queue, uint32_t queueLength, void *buffer, uint32_t bufferLength, uint32_t eof)
{
    int blockSize = bufferLength / queueLength;
    
    /* prepare linked DMA descriptors, having EOF set for all */
    for(int num = 0; num < queueLength; num++)
    {
        int nextNum = (num + 1) % queueLength;
        
        queue[num].owner = 1;
        queue[num].eof = eof;
        queue[num].sub_sof = 0;
        queue[num].datalen = blockSize;
        queue[num].blocksize = blockSize;
        queue[num].buf_ptr = (uint32_t)buffer + num * blockSize;
        queue[num].unused = 0;
        queue[num].next_link_ptr = (uint32_t)&queue[nextNum];
        
        //Serial.printf("%s[%d] (0x%08X) with %d bytes, buf_ptr (0x%08X), next %d (0x%08X)\n", name, num, &queue[num], queue[num].datalen, queue[num].buf_ptr, nextNum, queue[num].next_link_ptr);
    }
}

void ESP8266Can::InitI2S(void) 
{
    /* ----------------- setup buffers ----------------- */
    
    /* fill with dummy data */
    memset((void *)I2SBufferRxData, 0xDE, sizeof(I2SBufferRxData));
    memset((void *)I2SBufferTxData, 0xAD, sizeof(I2SBufferTxData));

    /* prepare linked DMA descriptors, having EOF set for all RX slots */
    PrepareQueue("I2SQueueRx", I2SQueueRx, COUNT(I2SQueueRx), I2SBufferRxData, sizeof(I2SBufferRxData), 0);
    PrepareQueue("I2SQueueTx", I2SQueueTx, COUNT(I2SQueueTx), I2SBufferTxData, sizeof(I2SBufferTxData), 1);
    
    
    /* ----------------- setup IO ----------------- */

    /* configure IO pins */
	PIN_FUNC_SELECT(PERIPHS_IO_MUX_MTDI_U, FUNC_I2SI_DATA);
	PIN_FUNC_SELECT(PERIPHS_IO_MUX_MTMS_U, FUNC_I2SI_WS);
	PIN_FUNC_SELECT(PERIPHS_IO_MUX_MTCK_U, FUNC_I2SI_BCK);
    
	PIN_FUNC_SELECT(PERIPHS_IO_MUX_U0RXD_U, FUNC_I2SO_DATA);
	PIN_FUNC_SELECT(PERIPHS_IO_MUX_GPIO2_U, FUNC_I2SO_WS);
	PIN_FUNC_SELECT(PERIPHS_IO_MUX_MTDO_U, FUNC_I2SO_BCK);
    
    
    /* ----------------- setup I2S ----------------- */
    
    /* configure I2S subsystem */
    I2S_CLK_ENABLE();
    CLEAR_PERI_REG_MASK(I2SCONF, I2S_I2S_RESET_MASK);
    SET_PERI_REG_MASK(I2SCONF, I2S_I2S_RESET_MASK);
    CLEAR_PERI_REG_MASK(I2SCONF, I2S_I2S_RESET_MASK);

    /* configure the operating mode */
    CLEAR_PERI_REG_MASK(I2SCONF, I2S_RECE_SLAVE_MOD|I2S_TRANS_SLAVE_MOD);
    SET_PERI_REG_MASK(I2SCONF, I2S_RIGHT_FIRST|I2S_MSB_RIGHT|I2S_RECE_MSB_SHIFT|I2S_TRANS_MSB_SHIFT);
    
    /* set speed and bit count (16 bit: 0 extra bits) */
	CLEAR_SET_REG_POS(I2SCONF, I2S_BITS_MOD_S, I2S_BITS_MOD, 0);
	CLEAR_SET_REG_POS(I2SCONF, I2S_BCK_DIV_NUM_S, I2S_BCK_DIV_NUM, (bestBckDiv)&I2S_BCK_DIV_NUM);
	CLEAR_SET_REG_POS(I2SCONF, I2S_CLKM_DIV_NUM_S, I2S_CLKM_DIV_NUM, (bestClkmDiv)&I2S_CLKM_DIV_NUM);
    
    
    /* Select 16bits per channel (FIFO_MOD=0), no DMA access (FIFO only) */
	CLEAR_SET_REG_POS(I2S_FIFO_CONF, I2S_I2S_RX_FIFO_MOD_S, I2S_I2S_RX_FIFO_MOD, 0);
	CLEAR_SET_REG_POS(I2S_FIFO_CONF, I2S_I2S_TX_FIFO_MOD_S, I2S_I2S_TX_FIFO_MOD, 0);
	CLEAR_SET_REG_POS(I2S_FIFO_CONF, I2S_I2S_RX_DATA_NUM_S, I2S_I2S_RX_DATA_NUM, 0);
	CLEAR_SET_REG_POS(I2S_FIFO_CONF, I2S_I2S_TX_DATA_NUM_S, I2S_I2S_TX_DATA_NUM, 0);
    
    /* Enable SLC DMA in I2S subsystem */
	CLEAR_SET_REG_POS(I2S_FIFO_CONF, 0, I2S_I2S_DSCR_EN, I2S_I2S_DSCR_EN);
    
    /* set dual channel data (CHAN_MOD=0) */
	CLEAR_SET_REG_POS(I2SCONF_CHAN, I2S_RX_CHAN_MOD_S, I2S_RX_CHAN_MOD, 0);
	CLEAR_SET_REG_POS(I2SCONF_CHAN, I2S_TX_CHAN_MOD_S, I2S_TX_CHAN_MOD, 0);
    
    /* set maximum I2S FIFO size to be transferred at once (in units of 4 bytes) */
	CLEAR_SET_REG_POS(I2SRXEOF_NUM, I2S_I2S_RX_EOF_NUM_S, I2S_I2S_RX_EOF_NUM, 128);
    
    
    /* ----------------- setup SLC ----------------- */

    /* reset DMA */
	SET_PERI_REG_MASK(SLC_CONF0, SLC_RXLINK_RST|SLC_TXLINK_RST|SLC_AHBM_RST|SLC_AHBM_FIFO_RST);
    CLEAR_PERI_REG_MASK(SLC_CONF0, SLC_RXLINK_RST|SLC_TXLINK_RST|SLC_AHBM_RST|SLC_AHBM_FIFO_RST);
    
	SET_PERI_REG_MASK(SLC_CONF0, SLC_TX_LOOP_TEST|SLC_RX_LOOP_TEST|SLC_RX_AUTO_WRBACK|SLC_RX_NO_RESTART_CLR|SLC_DATA_BURST_EN|SLC_DSCR_BURST_EN);
  
