g3gg0/esp8266can/ESP8266Can.cpp
	/* Enable and configure DMA */
	CLEAR_SET_REG_POS(SLC_CONF0, SLC_MODE_S, SLC_MODE, 1);
    
	SET_PERI_REG_MASK(SLC_RX_DSCR_CONF, SLC_INFOR_NO_REPLACE|SLC_TOKEN_NO_REPLACE);

    /* configure the first descriptors */
	CLEAR_SET_REG_POS(SLC_RX_LINK, 0, SLC_RXLINK_DESCADDR_MASK, I2SQueueRx);
	CLEAR_SET_REG_POS(SLC_TX_LINK, 0, SLC_TXLINK_DESCADDR_MASK, I2SQueueTx);

    /* set up SLC interrupt */
    ETS_SLC_INTR_DISABLE();
    SET_PERI_REG_MASK(SLC_INT_CLR, 0xffffffff);
    WRITE_PERI_REG(SLC_INT_ENA, SLC_INTEREST_EVENT);
    ETS_SLC_INTR_ATTACH((int_handler_t)i2sInterrupt, (void *)this);
    ETS_SLC_INTR_ENABLE();
}


void ESP8266Can::Loop(void (*cbr)(uint8_t *frame))
{
    static uint32_t lastTime = 0;
    uint32_t startTime = millis();
    uint32_t loops = 0;
    
    if(millis() - lastTime > 1000)
    {
        lastTime = millis();
        Serial.printf("[ESP8266Can] Rx: %d, RxErr: %d, RxQueueErr: %d\n", RxSuccess, RxErrStuffBits + RxErrCrc + RxErrFormat + RxErrAck, RxQueueOverflows);
        Serial.printf("[ESP8266Can] Tx: %d, TxErr: %d\n", TxSuccess, TxErrLineBusy + TxErrTransceiver + TxErrNoAck + TxErrArbitration + TxErrCollision);
    }
    
    /* dump CAN frames - to console for now */
    while(ReceiveBuffersReadNum != ReceiveBuffersWriteNum)
    {
        if(millis() - startTime > 100)
        {
            Serial.printf("[ESP8266Can] Aborting after %d loops\n", loops);
            break;
        }
        loops++;
        
        uint8_t *frame_buffer = InterruptReceiveBuffers[ReceiveBuffersReadNum];
        
        if(cbr)
        {
            cbr(frame_buffer);
        }
        
        /* next buffer */
        ReceiveBuffersReadNum = (ReceiveBuffersReadNum + 1) % INT_RX_BUFFERS;
    }
}

/* one CRC calculation step */
void ESP8266Can::CalcCRCBit(uint16_t *crc, uint16_t bit)
{
    uint16_t crcBit;
    
    crcBit = bit ^ ((*crc >> 14) & 1);
    *crc <<= 1;
    
    if(crcBit)
    {
        *crc = (*crc ^ 0x4599) & 0x7fff;
    }
}

/* calculate CRC for a given data buffer */
uint16_t ESP8266Can::CalcCRC(uint8_t *data, uint16_t startBit, uint16_t bitCount)
{
    uint16_t crc = 0;
    
    for(uint16_t bitPos = startBit; bitPos < startBit + bitCount; bitPos++)
    {
        uint16_t byteNum = bitPos / 8;
        uint16_t bitNum = bitPos % 8;
        uint8_t bitMask = (1 << (7 - bitNum));
        
        uint8_t bit = ((data[byteNum] & bitMask) != 0);
        
        CalcCRCBit(&crc, bit);
    }
    
    return crc & 0x7FFF;
}

/* assemble the transmission buffer and return the bit count. the first LEADING_BITS bits are not meant to be sent */
uint32_t ESP8266Can::BuildCanFrame(uint8_t *buffer, uint16_t id, uint8_t length, uint8_t *data, bool req_remote, bool self_ack)
{
    /* ensure fields do not exceed bit ranges */
    id &= 0x07FF;
    length &= 0x0F;
    
    /* place, but not send LEADING_BITS in front to make alignment easier */
    buffer[0] = 0xf8 | (0 << 2) |(id >> 9);
    buffer[1] = (id >> 1);
    buffer[2] = (id << 7) | ((req_remote ? 1 : 0) << 6) | length;
    
    memcpy(&buffer[3], data, length);
    
    uint16_t crc = CalcCRC(buffer, LEADING_BITS, 19 + length * 8);
    
    buffer[3 + length] = (crc >> 7);
    buffer[4 + length] = (crc << 1) | (1 << 0);
    buffer[5 + length] = ((self_ack ? 0 : 1) << 7) | 0x7F;
    buffer[6 + length] = 0xFF;
    buffer[7 + length] = 0xFF;
    
    /* return the number of bits to be sent (without trailing recessives) */
    return (1 + 11 + 1 + 1 + 1 + 4 + (8 * length) + 15 + 1 + 1 + 1 + 7);
}

/*  */
uint32_t ESP8266Can::DecodeCanFrame(uint8_t *buffer, uint16_t *id, uint8_t *length, uint8_t *data, bool *req_remote, bool *ack, bool errors)
{
    if(id)
    {
        *id = ((uint16_t)buffer[0] << 9) | ((uint16_t)buffer[1] << 1) | (buffer[2] >> 7);
    }
    if(req_remote)
    {
        *req_remote = (buffer[2] & 0x40) != 0;
    }
    uint8_t length_field = (buffer[2] & 0x0F);
    if(length)
    {
        *length = (length_field <= 8) ? length_field : 0;
    }
    
    bool id_ext = (buffer[2] & 0x20) != 0;
    bool reserved = (buffer[2] & 0x10) != 0;
    
    if(data)
    {
        memcpy(data, &buffer[3], *length);
    }
    
    uint16_t crc = ((uint16_t)buffer[3 + *length] << 7) | (buffer[4 + *length] >> 1);
    uint16_t crc_calced = CalcCRC(buffer, LEADING_BITS, 19 + *length * 8);
    
    bool crc_delim = (buffer[4 + *length] & 0x01) != 0;
    if(ack)
    {
        *ack = !((buffer[5 + *length] & 0x80) != 0);
    }
    
    if(!errors)
    {
        return 0;
    }
    
    /* DLC can go from 0 to 8 */
    if(length_field > 8)
    {
        Serial.printf("length err (%d>8) ", length_field);
        
        RxErrFormat++;
        return 1;
    }
    
    /* compare CRC with calculated one */
    if(crc != crc_calced)
    {
        Serial.printf("CRC: 0x%04X/0x%04X ", crc, crc_calced);
        
        RxErrCrc++;
        return 1;
    }
    
    /* CRC delimiter is always dominant */
    if(!crc_delim)
    {
        Serial.printf("CRC delim err");
        RxErrFormat++;
        return 1;
    }
    
    /* ACK slot must be dominant */
    if(!*ack)
    {
        Serial.printf("ACK err");
        RxErrAck++;
        return 1;
    }
    
    return 0;
}

/* try to get a free slot and transmit the CAN frame */
can_error_t ESP8266Can::SendMessage(uint16_t id, uint8_t length, uint8_t *data, bool req_remote, bool self_ack)
{
    /* a buffer of 32 bytes for the CAN frame is more than enough */
    uint8_t buffer[32];
    uint32_t bits = BuildCanFrame(buffer, id, length, data, req_remote, self_ack);

    /* will only get returned in case of _maxTries == 0 */
    can_error_t ret = ERR_BUSY_LINE;
    
    /* this is not very elegant and probably violates the standard, but it's good enough */
    for(int tries = 0; tries < _maxTries; tries++)
    {
        if(_debug)
        {
            Serial.printf("[CAN] Send ID:0x%03X, %d byte: ", id, length);            
        }
        can_error_t bitPos = sendRawData(buffer, cyclesBit(), cyclesSample(), LEADING_BITS, bits, pinRegisterTx(), pinRegisterRx());
        
        /* check why transmission failed */
        if(bitPos == ERR_BUSY_LINE)
        {
            /* the line wasn't recessive for some time */
            if(_debug)
            {
                Serial.printf("Line is busy\n");
            }
            TxErrLineBusy++;
            ret = ERR_BUSY_LINE;
        }
        else if(bitPos == ERR_TRCV_ERR)
        {
            /* the line wasn't recessive for some time */
            if(_debug)
            {
                Serial.printf("Transceiver error\n");
            }
            TxErrTransceiver++;
            ret = ERR_TRCV_ERR;
            break;
        }
        else if(bitPos == ERR_NO_ACK)
        {
            /* the line wasn't recessive for some time */
            if(_debug)
            {
                Serial.printf("No ACK error\n");
            }
            TxErrNoAck++;
            ret = ERR_NO_ACK;
            break;
        }
        else if(bitPos < 12)
        {
            /* it was within arbitration field */
            if(_debug)
            {
                Serial.printf("Arbitration error (bit %d / %d)\n", bitPos, bits);
            }
            TxErrArbitration++;
            ret = ERR_ARBRITATION;
        }
        else if(bitPos >= bits)
        {
            /* all bits transferred */
            if(_debug)
            {
                Serial.printf("Transferred\n");
            }
            TxSuccess++;
            return ERR_OK;
        }
        else
        {
            if(_debug)
            {
                Serial.printf("Collision (bit %d / %d)\n", bitPos, bits);
            }
            TxErrCollision++;
            ret = ERR_COLLISION;
        }
        
        /* wait a msec and try again */
        delay(1);
        
        ESP.wdtFeed();
    }
    
    return ret;
}

#endif
